{
  "greedycraft.fancymenu.custom.mainmenu.text.buttons.github": "Github",
  "greedycraft.fancymenu.custom.mainmenu.text.modpackname": "GreedyCraft·NIRVANA",
  "greedycraft.fancymenu.custom.mainmenu.text.author": "Team-GCTN",
  "greedycraft.fancymenu.custom.mainmenu.text.version": "Version",
  "greedycraft.fancymenu.custom.mainmenu.text.modloader.prefix": "Loader/Enable",
  "greedycraft.fancymenu.custom.mainmenu.text.modloader.suffix": "mods",
  "greedycraft.fancymenu.custom.mainmenu.text.welcom": "Welcom",
  "greedycraft.fancymenu.custom.mainmenu.text.time": "Time",
  "greedycraft.fancymenu.custom.mainmenu.text.noupdate": "LatestVersion",
  "greedycraft.fancymenu.custom.mainmenu.text.update": "Update",
  "greedycraft.fancymenu.custom.mainmenu.text.memoryusage": "Memory Usage",
  "greedycraft.fancymenu.custom.mainmenu.text.loadingtime": "Loading Time",
  "greedycraft.fancymenu.custom.mainmenu.text.used": "Used",
  
  "greedycraft.tips.text.1": "Supremium is a very good material for Tinker's Construct weapons! It's not hard to get if you have ways to grow crops quickly.",
  "greedycraft.tips.text.2": "You can throw all ores you get into your tinker's smeltery and see if they form new alloys.",
  "greedycraft.tips.text.3": "Press ~ button to mine ores or chop trees quickly! But it also consumes tool durability and hunger fast. Also, you might not be able to do this at the beginning.",
  "greedycraft.tips.text.4": "To throw an item, press the / button on your numpad.",
  "greedycraft.tips.text.5": "Consider adding a part made with Ardite to your pickaxe, it makes your pickaxe much more durable in practice!",
  "greedycraft.tips.text.6": "Use tinker's smeltery to make alloys. It's possible to cast liquids into blocks if you use a basin, which makes converting liquids into ingots much quicker.",
  "greedycraft.tips.text.7": "Build your smeltery as big as you can.",
  "greedycraft.tips.text.8": "You will no longer worry about getting full inventory when you max out a /dank/null!",
  "greedycraft.tips.text.9": "It's said that you can put a backpack into another mod's backpack, and another mod's backpack into another mod's backpack...",
  "greedycraft.tips.text.10": "If you are too lazy to build a house, look for villages or search for @Prefab to build one instantly!",
  "greedycraft.tips.text.11": "Remember to place a waystone next to the end portal you found, it's very useful.",
  "greedycraft.tips.text.12": "If you can't find endermen, you can farm ender pearls with a tiny mob farm!",
  "greedycraft.tips.text.13": "A Warp Scroll can teleport you to any waystone at anywhere, but is consumed when used! You can use a warp stone instead, it does not consume but has a cooldown!",
  "greedycraft.tips.text.14": "In adventure and casual modes, you don't lose items when dead but loses 75% of your XP!",
  "greedycraft.tips.text.15": "Use directional keys to adjust the 3rd person camera.",
  "greedycraft.tips.text.16": "You can throw useless tools found in the dungeon into the smeltery!",
  "greedycraft.tips.text.17": "If you can't find Blizz, you can pulverize permafrost stones found underground!",
  "greedycraft.tips.text.18": "Wires from different mods can usually be interconnected!",
  "greedycraft.tips.text.19": "1st person mode is more used when building or bridging.",
  "greedycraft.tips.text.20": "Eat different kinds of food to increase your max health! A multiblock kitchen might make that more easy.",
  "greedycraft.tips.text.21": "Building your base in a defiled land is a bad idea.",
  "greedycraft.tips.text.22": "Some ores are too rare? Grow them!",
  "greedycraft.tips.text.23": "It might be a good idea to keep a cow at home if you want constant milk supply. Also try to squash a cow into a milk jar with an falling anvil!",
  "greedycraft.tips.text.24": "Make a grappling hook to explore the world with style!",
  "greedycraft.tips.text.25": "Make a XP block to store your XP and never afraid about losing them again!",
  "greedycraft.tips.text.26": "Some tinker trait effects are actually negative, but sometimes it's necessary for mining better ores.",
  "greedycraft.tips.text.27": "You can craft leather with 4 rotten flesh!",
  "greedycraft.tips.text.28": "Lava's heat is not enough to smelt some ores, you need to seek for hotter liquids.",
  "greedycraft.tips.text.29": "Vanilla food are nerfed, you should cook better food with a kitchen!",
  "greedycraft.tips.text.30": "Don't worry about trampling your farm, farms can't be trampled now!",
  "greedycraft.tips.text.31": "Open loot bags quickly with a loot opener!",
  "greedycraft.tips.text.32": "Can't find a stuff? Hover over the desired item in JEI and press Y, if it's found in nearby chests you can see a smoke particle!",
  "greedycraft.tips.text.33": "Can't find an End City? You can craft an elytra! But it's expensive.",
  "greedycraft.tips.text.34": "If you consecutively eat a kind of food it will restore decreasingly lower hunger. Seek for a more variated diet.",
  "greedycraft.tips.text.35": "Mobs will occasionally turn into champions and gain a lot of stat boosts, be aware!",
  "greedycraft.tips.text.36": "Villagers now look like players and if they are happy you can marry with them?? You probably need a wedding ring.",
  "greedycraft.tips.text.37": "A Waystone can be found in every village, don't forget to activate them!",
  "greedycraft.tips.text.38": "You will occasionally see battle towers, with a powerful boss guarding the treasure. Be aware!",
  "greedycraft.tips.text.39": "You can convert elytra into a bauble to free up your body armor slot!",
  "greedycraft.tips.text.40": "View more advanced JEI search methods in JEI settings.",
  "greedycraft.tips.text.41": "If you feel laggy, try to use /purge to clear all ground items.",
  "greedycraft.tips.text.42": "Ever been to the Lost City dimension yet? For how to build the portal, see the modpack guide book.",
  "greedycraft.tips.text.43": "This tip doesn't hint anything, weird!",
  "greedycraft.tips.text.44": "Begin your journey to the Aether by building a glowstone frame and pouring water into it!",
  "greedycraft.tips.text.45": "The more Ender Dragons and Withers you fight, the stronger they become! But stronger enemies come with greater rewards, too.",
  "greedycraft.tips.text.46": "Try fishing! You can fish up many new treasures.",
  "greedycraft.tips.text.47": "Difficulty of mobs will increase as you progress!",
  "greedycraft.tips.text.48": "Damage calculation of armor points are different from vanilla. Now even leather armors are way better than being naked.",
  "greedycraft.tips.text.49": "As the difficulty increase, loot become better too!",
  "greedycraft.tips.text.50": "You can open quest menu in your inventory screen, it tells you what to do if you have no clue!",
  "greedycraft.tips.text.51": "Difficulty will increase when you defeat vanilla bosses for the first time.",
  "greedycraft.tips.text.52": "The lower your hunger is, the slower it gets consumed.",
  "greedycraft.tips.text.53": "There are many ways to increase your max health. You can try eating different kinds of food or crafting heart containers.",
  "greedycraft.tips.text.54": "Bosses gain less proportion of their health than normal mobs as difficulty increases, and some bosses have a fixed amount of health.",
  "greedycraft.tips.text.55": "Search with a @ followed by mod id to search all items registered by that mod.",
  "greedycraft.tips.text.56": "Craft two sand blocks into a Snad. It accelerates grow speed of sugarcanes and cactuses.",
  "greedycraft.tips.text.57": "You can build a 3*3*3 cube of chance cubes to make it turn into a mega chance cube. BEWARE: GIANT EXPLOSION CAN OCCUR.",
  "greedycraft.tips.text.58": "You might get a lot of enchanted items from loot or battle, use them to generate power! There's a dynamo specialization upgrade that can do this.",
  "greedycraft.tips.text.59": "Large ore deposits can be rarely found underground, if you find one you will get rich! Notice strange flower circles on the surface.",
  "greedycraft.tips.text.60": "Grappling hook can help a lot in the End. Get one before you go there!",
  "greedycraft.tips.text.61": "If you have lost the Omnipedia, you can craft one witn an Akashic Tome.",
  "greedycraft.tips.text.62": "Dragon metals are among the best tinker's materials and they can gain additional stats by upgrading via fusion crafting!",
  "greedycraft.tips.text.63": "Hover over an item and press Shift+del to delete all same kind of items in your inventory!",
  "greedycraft.tips.text.64": "If your save file fails to load or you messed up something really bad, restore the latest backup.",
  "greedycraft.tips.text.65": "You can craft solar panels for clean and efficient energy.",
  "greedycraft.tips.text.66": "Beware of champion mobs! They are very strong and some might pull you with The Force! They also drop some good loot.",
  "greedycraft.tips.text.67": "Chances for champion mobs to spawn depends on your difficulty!",
  "greedycraft.tips.text.68": "You are more likely to stumble upon large dungeons when far away from the spawn point!",
  "greedycraft.tips.text.69": "Right click a pure daisy to directly place blocks around it!",
  "greedycraft.tips.text.70": "Not enough building blocks? Use a chisel!",
  "greedycraft.tips.text.71": "It might be a good idea to build your base between two biomes because you can easily keep bees that require different biomes.",
  "greedycraft.tips.text.72": "§bI just added this tip to see if I can use colored text in tips.",
  "greedycraft.tips.text.73": "Infinity block block block can be used as beacon base!",
  "greedycraft.tips.text.74": "Search @ftbquests in JEI to look for some items that might help you complete quests!",
  "greedycraft.tips.text.75": "Want to sleep at day? build a hammock!",
  "greedycraft.tips.text.76": "Shift-click the '+' button in JEI recipe menu to move all items in your inventory to the crafting table.",
  "greedycraft.tips.text.77": "You might find tinker's artifacts in dungeons, they can't be modified until you unseal it with a §6Plate of Unsealing§r.",
  "greedycraft.tips.text.78": "You can only unlock the final reward by collecting enough medals.",
  "greedycraft.tips.text.79": "There is an ultimate quest which requires all other quests to be done. What is the reward? Don't ask me, I'm just a tip.",
  "greedycraft.tips.text.80": "Some tinker's materials have deep integration with the mods they come from.",
  "greedycraft.tips.text.81": "You haven't got Infinity Block Block Block Block Block Block Block Block Block yet?",
  "greedycraft.tips.text.82": "Sometimes quests reward creative shards, which can be further made into some creative mode items, with a bunch of other expensive stuff.",
  "greedycraft.tips.text.83": "You can insert §acolor codes§r anywhere to color your texts!",
  "greedycraft.tips.text.84": "When you have too many levels of jump boost, jump higher by holding the jump key.",
  "greedycraft.tips.text.85": "Mobs sometimes drop loot crate tickets, note that some levels of tickets can only be dropped at a higher difficulty.",
  "greedycraft.tips.text.86": "Inventory pets are your good companions, they provide a set of bonus and skills!",
  "greedycraft.tips.text.87": "Wires from XNet are better in performance because they aren't tile entities.",
  "greedycraft.tips.text.88": "You can start or stop a blood moon with Blood Sigil and Blood Sacrifice.",
  "greedycraft.tips.text.89": "You can set spawnpoint at day by clicking a bed.",
  "greedycraft.tips.text.90": "When you sleep, if you don't click on 'Set Spawn', spawn point will not be set!",
  "greedycraft.tips.text.91": "Not enough ores to use? You can use Mekanism to QUINTUPLE your ores!",
  "greedycraft.tips.text.92": "You die when you are killed.",
  "greedycraft.tips.text.93": "A boat might be helpful underground to get across the underground lakes.",
  "greedycraft.tips.text.94": "Wear your headsets for best game experience.",
  "greedycraft.tips.text.95": "Vanilla diamond pickaxe can't mine obsidian and vanilla weapons are nerfed. Please set up your tinker's workshop as soon as possible.",
  "greedycraft.tips.text.96": "Grass Strings are also strings.",
  "greedycraft.tips.text.97": "You can craft dragon breath using a glass bottle and a dragon egg! Dragon egg doesn't get consumed.",
  "greedycraft.tips.text.98": "Most ground decorations can be picked up by right clicking! Shift-right-click to pick up its block form.",
  "greedycraft.tips.text.99": "Your world will be blessed with new ores when defeating the Ender Dragon!",
  "greedycraft.tips.text.100": "Osram can only be found floating on lava oceans in the Nether. Lava Wader and obsidian boat may help you!",
  "greedycraft.tips.text.101": "Accessories can have prefixes, which can be changed by reforging. Craft a reforge station to do so.",
  "greedycraft.tips.text.102": "Use /purge command to clear dropped items when you experience lag while exploring.",
  "greedycraft.tips.text.103": "Mob spawners have a spawn limit and disables itself after spawning a set number of mobs.",
  "greedycraft.tips.text.104": "Most rewards of the battle tower require you to defeat its guardian and get the key.",
  "greedycraft.tips.text.105": "If you want some challenge, try Expert mode!",
  "greedycraft.tips.text.106": "When summoning the Wither, make sure there are no blocks near the structure. Some blocks might make your summon attempt fail.",
  "greedycraft.tips.text.107": "Note: Most mobs don't break blocks, but some bosses will, and all vanilla bosses can destroy blocks! Just don't summon a Wither at home.",
  "greedycraft.tips.text.108": "The Shady Merchant gives some tempting deals... but are they genuine?",
  "greedycraft.tips.text.109": "You can crush most of dungeon loot into time shards, which can be used to summon even more loot.",
  "greedycraft.tips.text.110": "Most tools and armors that don't belong to tinker's construct have been disabled. Try to find out the best combo of tinker's materials.",
  "greedycraft.tips.text.111": "You can make tinker's tools basically out of everything... Many more materials are added TiC integration in this modpack.",
  "greedycraft.tips.text.112": "Cosmilite is an extremely strong material, but also almost every other strong alloys combined.",
  "greedycraft.tips.text.113": "Some mobs only appear in hardmode!",
  "greedycraft.tips.text.114": "Mob spawners disable themselves after producing a set amount of mobs!",
  "greedycraft.tips.text.115": "Use /syncdifficulty command if your difficulty goes wrong.",
  "greedycraft.tips.text.116": "If you are bothered by warp, try to craft a §dPurifying Pill§r. It clears all warp on you.",
  "greedycraft.tips.text.117": "If your magnet on you keeps sucking items when you need them for crafting, try to craft a demagnetizer which disables this effect.",
  "greedycraft.tips.text.118": "You can simply jump over the fences, but mobs can't!",
  "greedycraft.tips.text.119": "If you find a lot of mud underground, you can find Cytosinite nearby.",
  "greedycraft.tips.text.120": "Do not care too much about enchanting. Tinker's tools don't need enchantments.",
  "greedycraft.tips.text.121": "Mystical crops grown in the typical way don't drop seeds. Use a organic infuser to grow crops!",
  "greedycraft.tips.text.122": "You can pass leaves, but leaves also slow you down.",
  "greedycraft.tips.text.123": "The chance for a meteor to spawn increases after you go to the nether once. The chance also increases greatly in a star shower.",
  "greedycraft.tips.text.124": "If you stay at a place for a long time, the chance for a meteor to spawn will get halved, if you stay for longer, it gets halved again.",
  "greedycraft.tips.text.125": "Occasionally at night, a star will fall from the sky, go after it and you can pick up a fallen star.",
  "greedycraft.tips.text.126": "You are 1.5 blocks tall when sneaking, which is just enough to pass a 3-slabs-tall hole.",
  "greedycraft.tips.text.127": "You can throw ingots or ores to the ground to instantly unify them according to their ore dictionary.",
  "greedycraft.tips.text.128": "When advanced tooltip (F3+H) is enabled, the ore dictionaris of an item will be listed in the tooltip with gold color.",
  "greedycraft.tips.text.129": "When getting hit by a spider you might gain increasingly high level of slowness. If you are already slow enough it can trap you with a cobweb!",
  "greedycraft.tips.text.130": "It's possible to find a giant tinker's smeltery in a village!",
  "greedycraft.tips.text.131": "Ever been to the depths of the ocean? That's where the Aqualite can be found.",
  "greedycraft.tips.text.132": "Pineapple doesn't go on pizza!",
  "greedycraft.tips.text.133": "When you fall into the void you will be sent into the Nether!",
  "greedycraft.tips.text.134": "Warning: don't play with thaumcraft at home. You have been warned.",
  "greedycraft.tips.text.135": "Got a bunch of dungeon loot but don't find them useful? Just crush them to time shards!",
  "greedycraft.tips.text.136": "Got a bunch of dungeon loot? You can generate power with them!",
  "greedycraft.tips.text.137": "Tip: don't play this game with a default skin.",
  "greedycraft.tips.text.138": "Use sharpening kits and polishing kits to repair your tools and armors.",
  "greedycraft.tips.text.139": "Thou shalt not strip mine.",
  "greedycraft.tips.text.140": "You can find urns that contain treasures! Beware of snakes!",
  "greedycraft.tips.text.141": "Aim for the mob's head when shooting. Headshots deal more damage!",
  "greedycraft.tips.text.142": "If the background music stops playing for too long, press alt + minus on numpad to reload Ambient mod.",
  "greedycraft.tips.text.143": "You can put all kinds of strange rocks into a Solid Centrifuge and see what you get!"
}